{
    "id": 481,
    "verse_number": 12,
    "chapter_number": 12,
    "slug": "chapter-12-verse-12",
    "text": "श्रेयो हि ज्ञानमभ्यासाज्ज्ञानाद्ध्यानं विशिष्यते।ध्यानात्कर्मफलत्यागस्त्यागाच्छान्तिरनन्तरम्।।12.12।।",
    "transliteration": "śhreyo hi jñānam abhyāsāj jñānād dhyānaṁ viśhiṣhyate\ndhyānāt karma-phala-tyāgas tyāgāch chhāntir anantaram\n",
    "word_meanings": "śhreyaḥ—better; hi—for; jñānam—knowledge; abhyāsāt—than (mechanical) practice; jñānāt—than knowledge; dhyānam—meditation; viśhiṣhyate—better; dhyānāt—than meditation; karma-phala-tyāgaḥ—renunciation of the fruits of actions; tyāgāt—renunciation; śhāntiḥ—peace; anantaram—immediately\n",
    "translations": [
        {
            "id": 3367,
            "description": "12.12 Knowledge is superior to blind action, meditation to mere knowledge, renunciation of the fruit of action to meditation, and where there is renunciation peace will follow.\n",
            "author_name": "Shri Purohit Swami",
            "language": "english"
        },
        {
            "id": 3366,
            "description": "12.12. For, knowledge is superior to practice; because of knowledge, meditation becomes pre-eminent; from meditation issues the renunciation of fruits of actions; and to renunciation, peace remains next.\t\t\t\t\t\n\n",
            "author_name": "Dr. S. Sankaranarayan",
            "language": "english"
        },
        {
            "id": 3365,
            "description": "12.12 Better indeed is knowledge than practice; than knowledge meditation is better; than meditation the renunciation of the fruits of actions: peace immediately follows renunciation.\n\n",
            "author_name": "Swami Sivananda",
            "language": "english"
        },
        {
            "id": 3364,
            "description": "12.12 Knowledge is surely superior to practice; meditation surpasses knowledge. The renunciation of the results of works (excels) meditation. From renunciation, Peace follows immediately.\n\n",
            "author_name": "Swami Gambirananda",
            "language": "english"
        },
        {
            "id": 3363,
            "description": "12.12 Far better is knowledge of the self then the repeated practice (of remembrance of the Lord). Better is meditation than this knowledge; Better is renunciation of fruits of action than meditation. From such renunciation, peace ensues.\n\n",
            "author_name": "Swami Adidevananda",
            "language": "english"
        },
        {
            "id": 3362,
            "description": "।।12.12।। अभ्यास से ज्ञान श्रेष्ठ है; ज्ञान से श्रेष्ठ ध्यान है और ध्यान से भी श्रेष्ठ कर्मफल त्याग है त्याग; से तत्काल ही शान्ति मिलती है।।\n ",
            "author_name": "Swami Tejomayananda",
            "language": "hindi"
        },
        {
            "id": 3361,
            "description": "।।12.12।।अभ्याससे शास्त्रज्ञान श्रेष्ठ है, शास्त्रज्ञानसे ध्यान श्रेष्ठ है और ध्यानसे भी सब कर्मोंके फलका त्याग श्रेष्ठ है। कर्मफलत्यागसे तत्काल ही परमशान्ति प्राप्त हो जाती है।",
            "author_name": "Swami Ramsukhdas",
            "language": "hindi"
        }
    ],
    "commentaries": [
        {
            "id": 7660,
            "description": "।।12.12।।तदिदं तात्पर्यमुपसंह्रियते -- श्रेय इति।  ज्ञानम् आवेशात्म अभ्यासाच्छ्रेयः (S??N आवेशात्मा  -- श्रेयान्) ? अभ्यासस्य तत्फलत्वात्।  तस्मादेवावेशात् ध्यानं भगवन्मयत्वं विशिष्यते याति? अभिमतप्राप्त्या।  सति ध्याने (S सति ध्यानेन ?N प्राप्त्यासत्तिव्यानेन) भगवन्मयत्वे कर्मफलानि संन्यसितुं युज्यन्ते।  अन्यथा अज्ञातरूपे (?N रूपत्वे) क्व संन्यासः  कर्मफलत्यागे च आत्यन्तिकी शान्तिः।  अतः सर्वमूलत्वात् आवेशात्मकं ज्ञानमेव प्रधानम्।",
            "author_name": "Sri Abhinavgupta",
            "language": "sanskrit"
        },
        {
            "id": 7653,
            "description": "।।12.12।।उत्तरश्लोकतात्पर्यमाह -- इदानीमिति। ज्ञानं शब्दयुक्तिभ्यामात्मनिश्चयः। अभ्यासो ज्ञानार्थश्रवणाभ्यासो निश्चयपूर्वको ध्यानाभ्यासो वा। तस्य विशिष्यमाणत्वे साक्षात्कारहेतुत्वं हेतुः। त्यागस्य विशिष्टत्वे हेतुमाह -- एवमिति। प्रीणातु भगवानिति तस्मिन्कर्मसंन्यासपूर्वकमित्यर्थः। पूर्वविशेषणवतो नियतचित्तस्य पुंसो यथोक्तत्यागादित्यर्थः। अनन्तरमेवेत्युक्तं व्यनक्ति -- नत्विति। नतु कर्मफलत्यागस्य सद्यःशान्तिकरत्वे सम्यग्धीरेव तथेति श्रुतिस्मृतिप्रसिद्धिर्विरुध्येत तत्राह -- अज्ञस्येति। दीर्घेण कालेनादरनैरन्तर्यानुष्ठिताद्ध्यानाद्वस्तुसाक्षात्कारद्वारा संसारदुःखोपशान्तेस्तथाविधाद्ध्यानात्त्यागस्य विशिष्टत्वोक्तेस्तदीयस्तुतिरत्रेष्टेत्याह -- अतश्चेति। तत्र हेतुमाह -- संपन्नेति। संपन्नानि प्राप्तानिसाधनान्यक्षरोपासनादीनि तेषां मध्ये पूर्वपूर्वस्यानुष्ठानाशक्तावुत्तरोत्तरस्यानुष्ठेयत्वेनोपदेशात्त्यागे चोपदेशपर्यवसानादित्यर्थः। त्यागे विशिष्टत्ववचनस्य केन साधर्म्येण तं प्रति स्तुतित्वमिति पृच्छति -- केनेति। उत्तरमाह --  यदेति। अमृतत्वमुक्तम्अथ मर्त्योऽमृतो भवति इति शेषादिति शेषः। कामप्रहाणस्यामृतत्वार्थत्वमथाकामयमान इत्यादावपि सिद्धमित्याह -- तदिति। कामत्यागस्यामृतत्वहेतुत्वेऽपि कथं कर्मफलत्यागस्य तद्धेतुत्वमित्याशङ्क्याह -- कामाश्चेति। कर्मफलत्यागादेव शान्तिश्चेज्ज्ञाननिष्ठोपेक्षितेत्याशङ्क्याह -- तत्त्यागे चेति। तथापि कथमज्ञस्य कर्मफलत्यागस्तुतिरित्याशङ्क्याह -- इति सर्वेति। विद्यावतस्त्यागवदविद्वत्त्यागस्यापि त्यागत्वाविशेषाद्विशिष्टत्वोक्तिर्युक्तेति स्तुतिमुपसंहरति -- इति,तत्सामान्यादिति। किमर्था स्तुतिरित्याशङ्क्य त्यागे रुचिमुत्पाद्य प्रवर्तयितुमित्याह -- प्ररोचनार्थेति। त्यागस्तुतिं दृष्टान्तेन स्पष्टयति -- यथेति। फलत्यागः श्रेयोहेतुश्चेत्कर्मत्यागादपि फलत्यागसिद्धेरलं कर्मानुष्ठानेनेत्याशङ्क्याह -- एवं कर्मेति। फलाभिलाषं त्यक्त्वा कर्मानुष्ठानस्यार्पितस्येश्वरे श्रेयोहेतुतया विवक्षितत्वान्नानुष्ठानानर्थक्यमित्यर्थः।",
            "author_name": "Sri Anandgiri",
            "language": "sanskrit"
        },
        {
            "id": 7654,
            "description": "।।12.12।।इदानीमवश्यकर्तव्यतायै सर्वकर्मफलसंन्यासं स्तौति -- श्रेयो हीति। विवेकपूर्वकाज्ज्ञानार्थाच्छ्रवणभ्यासाच्छ्रुतियुक्तिभ्यामानिश्चयरुपं ज्ञानं श्रेयः प्रशस्यतरं? ज्ञानादपि निदिध्यासनशून्याज्ज्ञानपूर्वकं ध्यानं विशिष्यते पशस्यं भवति? ध्यानादपि कर्मफलत्यागो विशिष्यते। यद्वाभ्यासान्निदिध्यासनाज्ज्ञानं श्रवणमननजं परोक्षं श्रेयः? ज्ञानादपि ध्यानं विष्णोः श्रवणकीर्तनादि विशिष्यते ततोऽपि कर्मफलत्याग इति तदेतदरुचिग्रस्तम्। अरुजिबीजं तु परोक्षादेर्निदिध्यासनस्य श्रैष्ठ्यप्रसिद्धिः। एवं मद्योगमाश्रितस्यात्मवतः सर्वकर्मफलत्यागात्सहेतुकस्य संसारस्य शान्तिरुपशमोऽनन्तरमेव स्यान्नतु कालान्तरमपेक्षते। नन्वेवंतरति शोकमात्मवित्?तमेव विदित्वादिमृत्युमेति। नान्यः पन्था विद्यतेऽयनाय?ज्ञानदेव तु कैवल्यं?ऋते ज्ञानान्न मोक्षः?यदा चर्मवदाकाशं विष्टयिष्यन्ति मानवाः। तदा देवमविज्ञाय दुःखस्यान्तो भविष्यति?नहि ज्ञानेन सदृशं पविन्नमिह विद्यते?ज्ञानं लब्धवा परां शान्तिमचिरेणाधिगच्छति इत्यादिश्रुतिस्मृतिप्रसिद्धिर्विरुध्यत इतिचेन्न। प्रकृतवचनस्य स्तुतुपरत्वात्। अक्षरोपासनादीनां साधनानां मध्ये पूर्वपूर्वानुष्ठानाशक्तावुत्तरोत्तरस्यानुष्ठेयत्वेनोपदेशात्त्यागे चोपदेशपर्यवसानादज्ञस्य कर्मणि प्रवृत्तस्य पूर्वपूर्वोपदिष्टसाधनेऽशक्तस्य सर्वकर्मफलत्याग उपदिष्टः स्तूयते प्रवृत्त्यर्थम्।यदा सर्वे प्रमुच्यते कामा येऽस्य हृदि स्थिताः। अथ मर्त्योऽमृतो भवत्यत्र ब्रह्म समश्रुते?प्रजहाति यदा कामान्त्सर्वान्पार्थ मनोगतान्। आत्मन्येवात्मना तुष्टः स्थितप्रज्ञस्तदोच्यते इत्यादिश्रुतिस्मृतिभ्यां विदुषो ध्याननिष्ठस्य कामानां सर्वकर्मफलानां त्यागादनन्तरं,शान्तेरुपक्तत्वादज्ञकृतसर्वकर्मत्यागस्यापि सर्वकाम्यकर्मत्यागसामान्यात्कर्मफलसंन्यासस्तुतिः प्ररोचनार्था। यथागस्त्येन ब्राह्मणेन समुद्रः पीतः। यथा वा परशुरामेण ब्राह्मणेनैकविंशतिवारं निःक्षत्रा पृथिवी कृतेति ब्राह्मणत्वसामान्यादितादींतना ब्राह्मणाः स्तूयन्ते।",
            "author_name": "Sri Dhanpati",
            "language": "sanskrit"
        },
        {
            "id": 7661,
            "description": "।।12.12।।ननु ज्ञानमभ्यासस्य साधनं? तत्कथं ततः श्रेयः इत्यत आह -- अज्ञानेति। एवेति केवलम्। ज्ञानाद्ध्यानं विशिष्यते इत्यसत्? सध्यानस्यापि ज्ञानस्य सम्भवात्। अज्ञानपूर्वस्य ध्यानस्य सम्भवाच्चेत्यत आह -- ज्ञानमात्रादिति। उपपत्तिलब्धमर्थं श्रुत्याऽपि द्रढयति -- तथा चेति। तत्सहितं ज्ञानसहितं ध्यानम्। ततो ज्ञानमात्रादधिकम्। ध्यानात्कर्मफलत्यागो विशिष्यत इत्येतदन्यथाप्रतीतिनिरासाय व्याख्याति -- ध्यानादिति। त्यागस्य प्रशस्तत्वमेवानेन लक्ष्यते? न प्रतीतार्थे तात्पर्यमित्यर्थः। कुतः इत्यत आह -- अन्यथेति।अथैतदप्यशक्तोऽसि कर्तुं [12।11] इति। ध्यानात्प्रत्यवरे कर्मयोगेऽप्यशक्तस्य कर्मफलत्यागः कथमन्यथाध्यानादाधिक्ये सत्युपदिश्यते इत्यर्थः। कर्मसन्न्यासात्कर्मफलरागसन्न्यासात् कर्मयोगोऽपि विशिष्यते किमुत ध्यानयोगः वक्ष्यमाणकर्मादिसर्वाधिकम्। परात्मन् परमात्मविषये। विरागः शोभनाध्यासाभावः।ननु तयोस्त्विति सर्वाधिकमिति चेत्तयोरपि वाक्यत्वात्कथं तद्विरोधेन ध्यानादिति वाक्यस्य स्वार्थे तात्पर्याभावो व्याख्यातः इत्यत आह -- वाक्येति। वाक्यत्वेन साम्येऽप्युपपत्तिसाहित्येन प्राबल्यादित्यर्थः। इतरत्र ध्यानादिति वाक्यस्य प्रतीतेऽर्थे युक्त्यनन्तरं चाह -- ध्यानादीति। त्यागो हि ध्यानज्ञाननिवृत्तकर्मानुष्ठानप्राप्तौ कारणत्वेनपरीक्ष्य लोकान् इत्यादौ उच्यते। न च फलात्साधनं श्रेयः। अतोऽपीयं स्तुतिरेवेत्यर्थः। अनेन लक्ष्यार्थोऽपि निष्कृष्योक्तो भवति। प्रकारान्तरेण व्याख्याति -- केवलेति। त्यागरहितात् ध्यानात्। ननु कुतो ध्यानादिति केवलस्य निर्धारणं कुतश्च कर्मफलत्यागः इति तत्सहितध्यानलक्षणात्यागस्य वा ध्यानसाहित्येनोपस्कार इत्यतः प्रतिज्ञापूर्वकमाह -- ध्यानेति। त्यागयुक्तं ध्यानं? ध्यानयुक्तस्त्याग इति द्विविधोक्त्योक्तं प्रकारद्वयं सूचयति। अन्यथा केवलत्यागाङ्गीकारे कथं चेत्यत्राप्यन्यथेति वर्तते। न केवलमन्यथानुपपत्त्याऽयमर्थः सिद्धः? किं तर्हि श्रुत्याऽपीत्याह -- तथा चेति। आद्यामन्यथानुपपत्तिमुपपादयति -- न हीति। ततश्चापरोक्ष्यमित्युक्तश्रुतिविरोधादिति भावः। उक्ताङ्गीकारे कथमेतत् अनुपपत्त्यभाव इत्यत आह -- भवति चेति। त्यागादिति सम्बन्धः। ज्ञानमात्रव्यवधानेनेति भावः। द्वितीयानुपपत्तिस्तुतयोस्तु [15।2] इत्युपपादितैव। ननुअथैतदप्यशक्तोऽसि [12।11] इत्यनेन केवलत्यागो विहितः? तत्प्ररोचनायश्रेयो हि [12।12] इति तस्य स्तुतिरुपक्रान्ता। न च केवलध्यानात् तत्फलत्यागयुक्तं ध्यानमधिकमिति व्याख्याने केवलत्यागस्तुतिर्लभ्यते? किन्तु तद्युक्तस्य ध्यानस्यैव। अतः पूर्वसङ्गतत्वात्पूर्वमेव व्याख्यानं युक्तम्? न तु द्वितीयं असङ्गतेरित्यत आह -- केवलेति। यथाऽनेन भृत्येन युक्तो राजा रिपूणां जेता? नाऽन्यथेत्युक्ते भृत्यस्य स्तुतिर्लभ्यते तथैवमप्यस्मिन्नपि व्याख्याने केवलत्यागस्तुतिर्युक्ता। ध्यानस्य ध्यानान्तराधिक्ये तत्साहाय्यस्य हेतुत्वेनोक्तत्वादित्यर्थः।",
            "author_name": "Sri Jayatritha",
            "language": "sanskrit"
        },
        {
            "id": 7655,
            "description": "।।12.12।।अज्ञानपूर्वादभ्यासाज्ज्ञानमेव विशिष्यते। ज्ञानमात्रात्सज्ञानं ध्यानम्। तथा च सामवेदे अनभिम्लानशाखायाम् -- अधिकं केवलाभ्यासाज्ज्ञानं तत्सहितं ततः। ध्यानं ततश्चापरोक्षं ततः शान्तिर्भविष्यति इति। ध्यानात्कर्मफलत्यागः इति तु स्तुतिः। अन्यथा कथमसमर्थोऽसीत्युच्यतेतयोस्तु कर्मसन्न्यासात्कर्मयोगो विशिष्यते [5।2] इति चोक्तम्। सर्वाधिकं ध्यानमुदाहरन्ति ध्यानाधिके ज्ञानभक्ती परात्मन्। कर्माफलाकाङ्क्षमथो विरागस्त्यागश्च न ज्ञानकलाफलार्हाश्च इति च काषायणशाखायाम्।वाक्यसाम्येऽप्यसमर्थविषयत्वोक्तेस्तात्पर्याभाव इतरत्र प्रतीयते। ध्यानादिप्राप्तिकारणत्वाच्च त्यागस्तुतिर्युक्ता। केवलध्यानात्फलत्यागयुक्तं ध्यानमधिकम्। ध्यानयुक्तत्याग एव चात्रोक्तः। अन्यथा कथंत्यागाच्छान्तिरनन्तरं इत्युच्यते कथं च ध्यानादाधिक्यम् तथा च गौपवनशाखायाम् -- ध्यानात्तु केवलात्त्यागयुक्तं तदधिकं भवेत् इति। न हि त्यागमात्रानन्तरमेव मुक्तिर्भवति भवति च ध्यानयुक्तात्। केवलत्यागस्तुतिरेवमपि भवति। यथाऽनेन युक्तो जेता? नान्यथेत्युक्तेः।",
            "author_name": "Sri Madhavacharya",
            "language": "sanskrit"
        },
        {
            "id": 7662,
            "description": "।।12.12।।इदानीमत्रैव साधनविधानपर्यवसानादिमं सर्वकर्मफलत्यागं स्तौति -- श्रेयोहीति। श्रेयः प्रशस्यतरं हि एव ज्ञानं शब्दयुक्तिभ्यामात्मनिश्चयः अभ्यासाज्ज्ञानार्थश्रवणाभ्यासाज्ज्ञानाच्छ्रवणमननपरिनिष्पन्नादपि ध्यानं निदिध्यासनसंज्ञं विशिष्यते अतिशयितं भवति। साक्षात्काराव्यवहितहेतुत्वात्। तदेवं सर्वसाधनश्रेष्ठं ध्यानं ततोऽप्यतिशयितत्वेनाज्ञकृतः कर्मफलत्यागः स्तूयते -- ध्यानादिति। ध्यानात्कर्मफलत्यागो विशिष्यत इत्यनुषज्यते। त्यागान्नियतचित्तेन पुंसा कृतात्सर्वकर्मफलत्यागात् शान्तिरुपशमः सहेतुकस्य संसारस्यानन्तरं अव्यवधानेन नतु कालान्तरमपेक्षते। अत्रयदा सर्वे प्रमुच्यन्ते कामा येऽस्य हृदि श्रिताः। अथ मर्त्योऽमृतो भवत्यत्र ब्रह्म समश्नुते इत्यादि श्रुतिषु? प्रजहाति यदा कामान्सर्वानित्यादिस्थितप्रज्ञलक्षणेषु च सर्वकामत्यागस्यामृतत्वसाधनत्वमन्तर्गतं कर्मफलानि च कामास्तत्त्यागोऽपि कामत्यागत्वसामान्यात्सर्वकामत्यागफलेन स्तूयते। यथागस्त्येन ब्राह्मणेन समुद्रः पीत इति यथा वा जामदग्न्येन ब्राह्मणेन निःक्षत्रा पृथिवी कृतेति ब्राह्मणत्वसामान्यादिदानींतना अपि ब्राह्मणा अपरिमेयपराक्रमत्वेन स्तूयन्ते तद्वत्।",
            "author_name": "Sri Madhusudan Saraswati",
            "language": "sanskrit"
        },
        {
            "id": 7656,
            "description": "।।12.12।।इममेव त्यागं सर्वपुरुषार्थमूलत्वात्स्तौति -- श्रेयो हीति। अभ्यासान्निदिध्यासनाज्ज्ञानं श्रवणमननजं परोक्षं श्रेयः। ज्ञानादपि ध्यानं विष्णोः श्रवणकीर्तनादि विशिष्यते। ततोऽपि कर्मफलत्यागः श्रेयान्। यस्मादनन्तरमव्यवधानेन शान्तिर्मोक्षोऽस्ति चित्तशुद्ध्याद्युत्पादनद्वारेण। अत्र बाह्यं साधनं सुकरत्वात्पूर्वपूर्वापेक्षया प्रशस्तमित्युच्यते तत्रैव प्रवृत्त्यतिशयाय। यद्वा श्रवणाद्यभ्यासात्तज्जं ज्ञानं तत्त्वनिश्चयात्मकं श्रेयः। ततोऽपि ज्ञातस्यार्थस्य साक्षात्कारार्थं ध्यानं श्रेयः। ततोऽपि कर्मफलत्यागः। योगी हि सर्वकर्मत्यागीप्रजहाति यदा कामान् इति प्रोक्तः। अयमपि कर्मफलत्यागेन कामाञ्जहात्येवेति तेन सम इति स्तूयते।",
            "author_name": "Sri Neelkanth",
            "language": "sanskrit"
        },
        {
            "id": 7663,
            "description": "।।12.12।।एवमुक्तानामुत्तरोत्तरकर्त्तव्यानां स्वरूपमाह -- श्रेय इति। अभ्यासात् केवलचित्ताकर्षणेनाऽनुस्मरणरूपात् ज्ञानं श्रेयः? श्रेष्ठमित्यर्थः। अतो ज्ञानयुक्तोऽभ्यास उत्तम इति भावः। ज्ञानात् केवलात् ध्यानं मत्स्वरूपानुचिन्तनात्मकं विशिष्टं भवतीत्यर्थः। तेन ज्ञानाभ्यासयुक्तं ध्यानमुत्तममिति भावः। ध्यानात् केवलात् कर्मफलत्याग उत्तमः। तेन ज्ञानाभ्यासध्यानसहितमदर्थकमत्कर्मकरणमुत्तममित्यर्थः। यत एवमतस्तादृशत्यागादनन्तरं शीघ्रमेव शान्तिर्मद्भक्ितस्थितिरूपा भवेदिति शेषः।",
            "author_name": "Sri Purushottamji",
            "language": "sanskrit"
        },
        {
            "id": 7657,
            "description": "।।12.12।।अत्यर्थप्रीतिविरहितात् कर्कशरूपात् स्मृत्यभ्यासाद् अक्षरयाथात्म्यानुसंधानपूर्वकं तदापरोक्ष्यज्ञानम् एव आत्महितत्वे विशिष्यते आत्मापरोक्ष्यज्ञानाद् अपि अनिष्पन्नरूपात् तदुपायभूतात्मध्यानम् एव आत्महितत्वे विशिष्यते? तद्ध्यानाद् अपि अनिष्पन्नरूपात् तदुपायभूतं फलत्यागेन अनुष्ठितं कर्म एव विशिष्यते।अनभिसंहितफलाद् अनुष्ठितात् कर्मणः अनन्तरम् एव निरस्तपापतया मनसः शान्तिः भविष्यति शान्ते मनसि आत्मध्यानं संपत्स्यते ध्यानाद् ज्ञानं ज्ञानात् च तदापरोक्ष्यं तदापरोक्ष्यात् परा भक्तिः इति भक्तियोगाभ्यासाशक्तस्य आत्मनिष्ठा एव श्रेयसी। आत्मनिष्ठस्य अपि अशान्तमनसो निष्ठाप्राप्तये अन्तर्गतात्मज्ञानानभिसंहितफलकर्मनिष्ठा एव श्रेयसी इत्यर्थः।।अनभिसंहितफलकर्मनिष्ठस्य उपादेयान् गुणान् आह -- ",
            "author_name": "Sri Ramanujacharya",
            "language": "sanskrit"
        },
        {
            "id": 7664,
            "description": "।।12.12।। --,श्रेयः हि प्रशस्यतरं ज्ञानम्। कस्मात् अविवेकपूर्वकात् अभ्यासात्। तस्मादपि ज्ञानात् ज्ञानपूर्वकं ध्यानं विशिष्यते। ज्ञानवतो ध्यानात् अपि कर्मफलत्यागः? विशिष्यते इति अनुषज्यते। एवं कर्मफलत्यागात् पूर्वविशेषणवतः शान्तिः उपशमः सहेतुकस्य संसारस्य अनन्तरमेव स्यात्? न तु कालान्तरम् अपेक्षते।।अज्ञस्य कर्मणि प्रवृत्तस्य पूर्वोपदिष्टोपायानुष्ठानाशक्तौ सर्वकर्मणां फलत्यागः श्रेयःसाधनम् उपदिष्टम्? न प्रथममेव। अतश्च श्रेयो हि ज्ञानमभ्यासात् इत्युत्तरोत्तरविशिष्टत्वोपदेशेन सर्वकर्मफलत्यागः स्तूयते? संपन्नसाधनानुष्ठानाशक्तौ अनुष्ठेयत्वेन श्रुतत्वात्। केन साधर्म्येण स्तुतित्वम् यदा सर्वे प्रमुच्यन्ते (क0 उ0 6।14) इति सर्वकामप्रहाणात् अमृतत्वम् उक्तम् तत् प्रसिद्धम्। कामाश्च सर्वे श्रौतस्मार्तकर्मणां फलानि। तत्त्यागे च विदुषः ध्याननिष्ठस्य अनन्तरैव शान्तिः इति सर्वकामत्यागसामान्यम् अज्ञकर्मफलत्यागस्य अस्ति इति तत्सामान्यात् सर्वकर्मफलत्यागस्तुतिः इयं प्ररोचनार्था। यथा अगस्त्येन ब्राह्मणेन समुद्रः पीतः इति इदानींतनाः अपि ब्राह्मणाः ब्राह्मणत्वसामान्यात् स्तूयन्ते? एवं कर्मफलत्यागात् कर्मयोगस्य श्रेयःसाधनत्वमभिहितम्।।अत्र च आत्मेश्वरभेदमाश्रित्य विश्वरूपे ईश्वरे चेतःसमाधानलक्षणः योगः उक्तः? ईश्वरार्थं कर्मानुष्ठानादि च। अथैतदप्यशक्तोऽसि (गीता 12।11) इति अज्ञानकार्यसूचनात् न अभेददर्शिनः अक्षरोपासकस्य कर्मयोगः उपपद्यते इति दर्शयति तथा कर्मयोगिनः अक्षरोपासनानुपपत्तिम्। ते प्राप्नुवन्ति मामेव (गीता 12।4) इति अक्षरोपासकानां कैवल्यप्राप्तौ स्वातन्त्र्यम् उक्त्वा? इतरेषां पारतन्त्र्यात् ईश्वराधीनतां दर्शितवान् तेषामहं समुद्धर्ता (गीता 12।7) इति। यदि हि ईश्रवस्य आत्मभूताः ते मताः अभेददर्शित्वात्? अक्षरस्वरूपाः एव ते इति समुद्धरणकर्मवचनं तान् प्रति अपेशलं स्यात्। यस्माच्च अर्जुनस्य अत्यन्तमेव हितैषी भगवान् तस्य सम्यग्दर्शनानन्वितं कर्मयोगं भेददृष्टिमन्तमेव उपदिशति। न च आत्मानम् ईश्वरं प्रमाणतः बुद्ध्वा कस्यचित् गुणभावं जिगमिषति कश्चित्? विरोधात्। तस्मात् अक्षरोपासकानां सम्यग्दर्शननिष्ठानां संन्यासिनां त्यक्तसर्वैषणानाम् अद्वेष्टा सर्वभूतानाम् (गीता 12।13) इत्यादिधर्मपूतं साक्षात् अमृतत्वकारणं वक्ष्यामीति प्रवर्तते -- ",
            "author_name": "Sri Shankaracharya",
            "language": "sanskrit"
        },
        {
            "id": 7658,
            "description": "।।12.12।। तमिमं फलत्यागं स्तौति -- श्रेयो हीति। सम्यग्ज्ञानरहितादभ्यासाद्युक्तिसहितोपदेशपूर्वकं ज्ञानं श्रेष्ठं। तस्मादपि तत्पूर्वकं ध्यानं श्रेष्ठं।ततस्तु तं पश्यति निष्कलं ध्यायमानः इति श्रुतेः। तस्मादप्युक्तलक्षणः कर्मफलत्यागः श्रेष्ठः? तस्मादेवं,भूतात्कर्मफलत्यागात्कर्मसु तत्फलेषु चासक्तिनिवृत्त्या मत्प्रसादेन च समनन्तरमेव संसारशान्तिर्भवति।",
            "author_name": "Sri Sridhara Swami",
            "language": "sanskrit"
        },
        {
            "id": 7665,
            "description": "।।12.12।।तमिमं फलादित्यागं स्तौति -- श्रेयो हीति। अभ्यासादुक्तपूर्वात् युक्तिसहितोपदेशपूर्वकं सर्वज्ञानं श्रेष्ठं? ततो ध्यानं निषेवणं? ततश्च फलत्यागः? ततोऽनन्तरं शान्तिः स्वास्थ्यमेव भवतीति विशिष्यते। शान्तिर्हि लाभेऽलाभे जये़ऽजये च मनस उपशमस्वरूपा? ततश्च कृतार्थतेत्यर्थसिद्धम्।",
            "author_name": "Sri Vallabhacharya",
            "language": "sanskrit"
        },
        {
            "id": 7659,
            "description": "।।12.12।।अथाव्यवहितोपायानधिकारनिमित्तखेदनिवृत्त्यर्थं रजनीकरबिम्बलिप्सोदस्तहस्तस्तनन्धयवदशक्ये प्रवृत्तिपरिहारार्थं च व्यवहितानेवोपायान्यथाधिकारं सौकर्यातिशयेन प्रशंसन्नुक्तमुपपादयति -- श्रेयो हि इति। यथावस्थितवेषेणाभ्यासात्तदुपायस्य श्रेयस्त्वं वक्तुमयुक्तं वैपरीत्यात् अतोऽनधिकारिणा क्रियमाणो भगवदभ्यासः परिपक्वफलरसलोलुपबटुकरमृदितशलाटुवद्विरस एव स्यादिति तदपेक्षया यथावस्थितसरसाभ्यासहेतोः श्रेयस्त्वमुचितमेव भवेदित्यभिप्रायेणअत्यर्थप्रीतिरहितादित्युक्तम्। त एव च पित्तोपहतपयःपानवदक्षीणपापस्य दुष्करतामाहकर्कशरूपादिति। अत्र परमात्माभ्यासोपायत्वेन विहितं ज्ञानं जीवात्मविषयमेव युक्तम् तच्च ध्यानसाध्यत्वेन विवक्षितत्वादपरोक्षाकारमित्यभिप्रायेणअक्षरयाथात्म्यानुसन्धानपूर्वकं तदापरोक्ष्यज्ञानमित्युक्तम्।श्रेयः इत्यस्यविशिष्यते इत्यस्य च समानार्थत्वज्ञापनायहितत्वे विशिष्यत इत्युक्तम्। व्यवहितोपायस्यापि सौकर्यातिशयलक्षणमत्र हितत्वम् न तु मुख्यत्वादिरूपम्।अनिष्पन्नरूपादित्यस्यापि पूर्ववदभिप्रायः। कर्मणो रजस्तमोमूलरागद्वेषादिनिवृत्तिरूपशान्तिजनकत्वेऽवान्तरव्यापारमाहनिरस्तपापतयेति। ननुत्यागाच्छान्तिः इत्यत्रापि पूर्ववच्छ्रेयस्त्वविधानमेवोचितम्? अन्यथा रीतिभङ्गप्रसङ्गात्? ध्यानस्य कर्मसाध्यतया विवक्षितत्वेन ततोऽन्यस्य कर्मसाध्यत्वनिर्देशायोगात् शान्तिव्यवहितस्य च कथं वैशिष्ट्यमित्यत्राह -- शान्ते मनसीति।अयमभिप्रायः -- अनन्तरम् इति निर्देशेनैव रीतिस्त्यक्तेति प्रतीयते यतश्च यदनन्तरं यद्दृश्यते? तस्य तत्कार्यत्वमेव व्यक्तम् ध्यानं प्रति शान्तेर्हेतुतया ध्यानस्य कर्मसाध्यत्वात्तद्वैशिष्ट्याभिप्रायानुरूपमेव चेदम् इति। अत्रत्यागाच्छान्तिंरनन्तरम् इति हेतुकार्यभावनिर्देश उपलक्षणतया ध्यानादिष्वप्यभिमत इति ज्ञापनायध्यानाच्चेत्यादिकमुक्तम्। ननुश्रेयो हि ज्ञानमभ्यासात् इत्यत्र स्वारस्येन अभ्यासप्रभृत्युत्तरोत्तरमन्तरङ्गत्वाकारेण प्रकृष्टं ज्ञानादिकमिति किं नाङ्गीक्रियते इत्यत्र पिण्डितार्थं वदन् व्यवहितनिष्ठाश्रैष्ठ्यं निगमयतिइति भक्तियोगाभ्यासाशक्तस्येति।अयमभिप्रायः -- अथ चित्त समाधातुं न शक्नोषि [12।9] इति ह्युपक्रान्तम्अथैतदप्यशक्तोऽसि [12।11] इत्यनेन च भक्तियोगाङ्कुरेऽप्यशक्तस्य कर्मफलत्यागो विहितः स चात्रध्यानात्कर्मफलत्यागः इति प्रत्यभिज्ञायते ततश्चाभ्यासापेक्षया तस्याशक्तविषयत्वे सिद्धे तदुभयमध्यगतयोरपि ज्ञानध्यानयोरभ्यासात्पूर्वभावित्वेन कर्मणः परत्वेन च प्रतीयमानयोस्तत्तदशक्ताधिकारिविशेषविषयत्वं सिद्धम् -- इति।",
            "author_name": "Sri Vedantadeshikacharya Venkatanatha",
            "language": "sanskrit"
        },
        {
            "id": 7652,
            "description": "।।12.12।। भ्रमित शिष्य को उपदेश देते समय गुरु के लिए यह पर्याप्त नहीं है कि वह केवल दार्शनिक सत्यों का नाम निर्देश कर उनकी गणना करें। आवश्यकता होती है उन विचारों के एक ऐसी सुन्दर संयोजना की? जिससे विद्यार्थी को सभी विचार पुष्पगुच्छ के समान एक ही स्थान पर प्राप्त हो जायें। इससे तत्त्व को समझने में सहायता मिलती है। भगवान् श्रीकृष्ण के प्रवचन का विचाराधीन श्लोक एक ऐसा ही उदाहरण विशेष है? जिसमें अब तक किये सैद्धांतिक विवेचन को एक सुसंयोजित विचार पद्धति से प्रस्तुत किया गया है।इस श्लोक में सैद्धांतिक विचारों को उनके महत्त्व की दृष्टि से उतरते क्रम में रखा गया है। एक बार यदि साधना के इस सोपान को साधक भली भाँति समझ लेता है और इस सोपान पर आरोहण व अवरोहण की कला भी सीख लेता है? तो यह माना जा सकता है कि उसने इस अध्याय के विवेचित सभी महत्त्वपूर्ण विषयों को पूर्णरूप से समझ लिया है।अभ्यास से ज्ञान श्रेष्ठ है  आध्यात्मिक साधनाएं केवल शारीरिक क्रियायें नहीं हैं? वरन् उनका प्रय़ोजन हमारे मन और बुद्धि को अर्थात् हमारे आन्तरिक व्यक्तित्व को सुगठित करना है। शरीर से की जाने वाली भक्ति साधना को अन्तकरण का सहयोग तब तक नहीं मिलेगा? जब तक कि साधक को उसके द्वारा की जा रही साधना का सम्यक् ज्ञान नहीं होता। शारीरिक क्रियाओं को मन का भक्तिभावनापूर्ण सहयोग प्राप्त कराने के पूर्व बुद्धि का परिवर्तन अत्यावश्यक होता है। हम जिसका अभ्यास कर रहे हैं और उसका प्रयोजन क्या है? इसका पूर्ण ज्ञान होना योग को सफल बनाने के लिए अपरिहार्य है। इसलिए यहाँ कहा गया है कि केवल यन्त्रवत् साधनाभ्यास करने की अपेक्षा उसके मनोवैज्ञानिक? बौद्धिक और आध्यात्मिक आशयों का ज्ञान होना अधिक श्रेष्ठ और महत्त्वपूर्ण है।ज्ञान से श्रेष्ठ ध्यान है  श्रवणादि साधनों से प्राप्त किये गये ज्ञान पर ध्यान करना उस ज्ञान से अधिक श्रेष्ठ है। आध्यात्मिक साधनाओं की प्रक्रिया और प्रय़ोजन के शास्त्रीय ज्ञान को समझने की अपेक्षा उन्हें सीखना अधिक सरल होता है। श्रवण से प्राप्त ज्ञान को आत्मसात् करने के लिए उस पर विचारपूर्वक मनन और ध्यान की आवश्यकता होती है। शास्त्रवाक्यों के केवल शाब्दिक अर्थ को जानने से यह कार्य सम्पादित नहीं हो सकता। इसलिए मनन और निदिध्यासन अनिवार्य़ होते हैं। केवल श्रवण से किये गये ज्ञान से आत्मसात् किया हुआ ज्ञान निश्चित ही अधिक श्रेष्ठ होता है उसे आत्मसात् करने का साधन ध्यान है? इसलिए महत्व के अनुक्रम में ध्यान को ज्ञान की अपेक्षा अधिक श्रेष्ठ कहा गया है।ध्यान से भी श्रेष्ठ कर्मफल त्याग है  वर्तमान में प्राप्त ज्ञान की परिसीमा के परे सुदूर स्थित श्रेष्ठतर ज्ञान को प्राप्त करने के लिए उड़ान भरने का बुद्धि का प्रयत्न ही ध्यान कहलाता है। इस उड़ान के लिए बुद्धि के पास शक्ति और सन्तुलन का होना आवश्यक है। उस व्यक्ति के लिए ध्यान का अभ्यास असंभव है? जिसके मन की शक्ति और स्थिरता? भावी फलों की चिन्ता व कल्पना के कारण छिन्नभिन्न हो गयी होती हैं। पूर्व श्लोक की व्याख्या में हम देख चुके हैं कि किस प्रकार भविष्य के प्रति हमारी चिन्ता और व्याकुलता? वर्तमान में कार्य करने की हमारी क्षमता को नष्ट कर देती हैं। सभी कर्मफल भविष्य में ही आते हैं और इनकी चिन्ता करने का अर्थ है? असंख्य म्ाानसिक विक्षेपों को आमन्त्रित करना। इस प्रकार विक्षुब्ध अन्तकरण से कोई भी साधक शास्त्र प्रतिपादित सत्य पर न मनन कर सकता है और न ध्यान। इसलिए यहाँ भगवान् श्रीकृष्ण कर्मफल त्याग को श्रेष्ठ स्थान प्रदान करते हैं।अपने कथन पर टिप्पणी को जोड़ते हुए भगवान् कहते हैं कि? त्याग से तत्काल शान्ति मिलती है। हिन्दू धर्म में संन्यास का वास्तविक अर्थ यह है कि इन्द्रियों का विषयों के साथ सम्पर्क होने से उत्पन्न होने वाले सुख भोग की बन्धनकारक आसक्तियों को त्याग देना।इस त्याग के परिणामस्वरूप साधक को अन्तकरण की प्रभावशाली शान्ति और स्थिरता प्राप्त होती है। ऐसे शान्त वातावरण में बुद्धि शास्त्र के ज्ञान पर मनन करके उसमें वर्णित आत्मविकास के साधनों को सम्यक् प्रकार से समझ पाती है और इस प्रकार ज्ञानपूर्वक ध्यान का अभ्यास करने पर साधक को निश्चित ही सफलता मिलती है।अब? अक्षर और अव्यक्त की उपासना करने वाले ज्ञानी भक्तजनों के आंतरिक लक्षण? अगले श्लोक में बताये जा रहे हैं? जो साधकों के लिए पूर्णत्व प्राप्ति के उपायभूत साक्षात् साधन हैं",
            "author_name": "Swami Chinmayananda",
            "language": "hindi"
        },
        {
            "id": 7651,
            "description": "।।12.12।। व्याख्या--[भगवान्ने आठवें श्लोकसे ग्यारहवें श्लोकतक एक-एक साधनमें असमर्थ होनेपर क्रमशः समर्पण-योग, अभ्यासयोग, भगवदर्थ कर्म और कर्मफल-त्याग--ये चार साधन बताये। इससे ऐसा प्रतीत होता है कि क्रमशः पहले साधनकी अपेक्षा आगेका साधन नीचे दर्जेका है, और अन्तमें कहा गया कर्मफलत्यागका साधन सबसे नीचे दर्जेका है। इस बातकी पुष्टि इससे भी होती है कि पहलेके तीन साधनोंमें भगवत्प्राप्तिरूप फलकी बात ('निवसिष्यसि मय्येव' , मामिच्छाप्तुम्' तथा 'सिद्धिमवाप्स्यसि'  --  इन पदोंद्वारा) साथ-साथ कही गयी; परन्तु ग्यारहवें श्लोकमें जहाँ कर्मफलत्याग करनेकी आज्ञा दी गयी है, वहाँ उसका फल भगवत्प्राप्ति नहीं बताया गया।",
            "author_name": "Swami Ramsukhdas",
            "language": "hindi"
        },
        {
            "id": 7666,
            "description": "12.12 श्रेयः better? हि indeed? ज्ञानम् knowledge? अभ्यासात् than practice? ज्ञानात् than knowledge? ध्यानम् meditation? विशिष्यते excels? ध्यानात् than meditation? कर्मफलत्यागः the renunciation of the fruits of actions? त्यागात् from renunciation? शान्तिः peace? अनन्तरम् immediately.Commentary Theoretical or indirect knowledge of Brahman gained from the scriptures is better than the practice (of restraining the modifications of the mind or worship of idols or selfmortification for the purpose of control of the mind and the senses) accompained with ignorance. Meditation is better than theoretical knowledge. Renunciation of the fruits of actions is bettern than meditation. Renunciation of the fruits of all actions as a means to the attainment of supreme peace or Moksha is merely eulogised here by the declaration of the superiority of one over the other to encourage Arjuna (and other spiritual aspirants) to practise Nishkama Karma Yoga? to create a strong desire in them to take up the Yoga of selfless action? in the same manner as by saying that the ocean was drunk by the Brahmana sage Agastya even the Brahmanas of this age are extolled because they are also Brahmanas.Desire is an enemy of peace. Desire causes restlessness of the mind. Desire is the source of all human miseries? sorrows and troubles. Stop the play of desire through discrimination? dispassion and eniry into the nature of the Self then you will enjoy supreme peace.Renunciation of the fruits of actions? is prescribed for the purification of the aspirants heart. It annihlates desire? the enemy of wisdom. The sage? too? renounces the fruits of actions. It has become natural to him to do so.",
            "author_name": "Swami Sivananda",
            "language": "english"
        }
    ]
}